{
  "portfolioInfo": {
    "title": "JP Carrascal - Portafolio de Proyectos",
    "subtitle": "Portafolio (selección) de Música, Sonido y Medios Interactivos",
    "contact": {
      "email": "jp@jpcarrascal.com",
      "website": "jpcarrascal.github.io",
      "period": "2010-2025"
    }
  },
  "projects": [
    {
      "id": "spacebarman",
      "title": "Spacebarman",
      "year": "2010 - Presente",
      "authors": "JP Carrascal",
      "tags": ["Música Electrónica", "Actuación en Vivo", "Instalación Interactiva"],
      "subtitle": "Proyecto de música electrónica / experimental",
      "description": "Spacebarman es mi principal proyecto de música electrónica/experimental, mi alter-ego musical. La música de Spacebarman explora la disolución del ego y de las ideas dentro del océano digital de las redes de computadores. Sus conciertos son un laboratorio de arte digital donde dispositivos interactivos y visuales reactivos desarrollados con ayuda de IA crean una experiencia inmersiva para la audiencia.",
      "medium": "Música electrónica: actuaciones en vivo con visuales interactivos e IA",
      "exhibition": ["Almagro Film Festival, Spain, 2025", "Festival Acoustic Vell, Girona, Spain, 2025", "ManasiaHub, Bucharest, Romania, 2025", "Sofia Live Club, Sofia, Bulgaria, 2025", "Madame Claude, Berlin, 2024", "Otros (2010-2024)"],
        "publication": ["2025: Sometimes We Go To Dark Places, Wanderlust, Los Monstruos de Esta Ciudad, Premonición","2024: La Sed, The Place You'll Never See, El Ansia, No Place for Us","2020: FOMO", "2018: Persona", "2012: Si Algún Día Todo Falla", "2011: A Veces Me Pierdo, Bad Boy"],
      "image": "../projects/spacebarman/images/spacebarman-madameclaude.jpg",
      "selected": true
    },
    {
      "id": "a-sense-of-surrounding",
      "title": "A Sense Of Surrounding",
      "year": 2024,
      "authors": "JP Carrascal, Tom DeMajo",
      "tags": ["Instalación Interactiva"],
      "subtitle": "Paisaje sonoro participativo para promover la conciencia ambiental. Presentado en Ars Electronica 2024 (Linz, Austria). Apoyado por ArtEO.",
      "description": "A Sense of Surrounding es una instalación de paisaje sonoro participativo diseñada para promover la conciencia ambiental a través de experiencias de audio inmersivo. Fue presentado en el prestigioso festival Ars Electronica 2024 en Linz, Austria, uno de los festivales más importantes del mundo de artes digitales y música electrónica.\n\nLa instalación crea un ambiente interactivo donde los participantes pueden interactuar con temas ambientales a través de paisajes sonoros cuidadosamente elaborados. El trabajo aprovecha el poder del audio para crear conexiones emocionales con cuestiones ambientales, fomentando una reflexión más profunda sobre la relación de la humanidad con la naturaleza. Apoyado por ArtEO (www.arteo.earth), una organización dedicada a promover la conciencia ambiental a través de observación satelital.",
      "medium": "Digital: instalación de sonido interactivo colaborativo",
      "exhibition": ["Ars Electronica 2024, Linz, Austria"],
      "publication": ["Juan Pablo Carrascal and Tom DeMajo. Conference Proceedings of CHIME One Day Workshop 2023, The Open University, Milton Keynes, 4 December 2023."],
      "image": "../projects/a-sense-of-surrounding/images/main.jpg",
      "selected": true
    },

        {
      "id": "syntheo",
      "title": "SynthEO",
      "year": 2024,
      "authors": "JP Carrascal",
      "tags": ["sonification","web"],
      "subtitle": "Sintetizador sinestésico basado en sonificación de imágenes satelitales. Apoyado por ArtEO.",
      "description": "SynthEO es un sistema de sonificación que analiza y extrae la paleta de colores de imágenes satelitales y las convierte en paisajes sonoros interactivos. En su versión actual, utiliza una biblioteca de imágenes satelitales facilitadas por ArtEO para el programa de Pioneros de ArtEO. Funciona sobre un browser de escritorio o móvil.\n\nEl sistema mapea colores específicos a parámetros de síntesis de sonido, permitiendo a los usuarios explorar y manipular los datos visuales a través de la interacción sonora. SynthEO ofrece una experiencia sinestésica única, donde los usuarios pueden 'escuchar' las características visuales de las imágenes satelitales, creado una experiencia estética y una capa adicional de interpretación de los datos ambientales representados en las imágenes.",
      "medium": "Digital: aplicación web",
      "exhibition": ["Aplicación web disponible en https://www.arteo.earth/stories/syntheo"],
      "image": "../projects/syntheo/images/syntheo.jpg",
      "selected": true
    },
        {
      "id": "exposition-aperture",
      "title": "Exposition Aperture",
      "year": 2024,
      "authors": "Tom DeMajo, JP Carrascal",
      "tags": ["digital video","large format"],
      "subtitle": "Video digital en grand formato presentado en Ars Electronica 2024 (Linz, Austria). Apoyado por ArtEO.",
      "description": "Exposition Aperture comienza con una línea de un solo píxel de ancho, que se abre gradualmente como un telón para revelar imágenes completas de satélite, acompañada por un paisaje sonoro inquietante y cambiante. Se trata de una colaboración con Tom deMajo, quien desarrolló el video con base en una banda sonora generada con SynthEO (incluído en este portafolio).",
      "medium": "Video digital",
      "exhibition": ["Ars Electronica 2024, Linz, Austria"],
      "image": "../projects/exposition-aperture/images/exposition-aperture.jpg",
      "selected": true
    },
    {
      "id": "intangible",
      "title": "InTangible",
      "year": 2023,
      "authors": "JP Carrascal, Ina Ghita",
      "tags": ["Instalación de Arte"],
      "subtitle": "Una Reflexión sobre la Copropiedad Digital vs. Física",
      "description": "InTangible es un proyecto artístico que explora las complejas relaciones entre la propiedad digital y física en la sociedad contemporánea. A través de la instalación de medios mixtos, este proyecto examina cómo entendemos la posesión, el valor y la copropiedad en un mundo cada vez más digital.\n\nEl trabajo desafía las nociones tradicionales de propiedad creando escenarios donde los objetos digitales y físicos se cruzan, cuestionando qué significa \"poseer\" algo en la era digital. A través de elementos interactivos y representaciones visuales, se invita a los participantes a considerar cómo la tecnología reshape nuestra comprensión de la propiedad y los recursos compartidos.",
      "medium": "Medios mixtos: lienzo tejido, impresora 3D reciclada, aplicación alojada en la nube",
      "themes": "Propiedad Digital, NFTs, Copropiedad",
      "exhibition": ["TEI Art Exhibition, Warsaw, Poland, 2023."],
      "publication": ["Juan Pablo Carrascal and Ina Ghita. 2023. InTangible: A Reflection On Digital vs. Physical Co-Ownership. In Proceedings of the Seventeenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '23). Association for Computing Machinery, New York, NY, USA, Article 61, 1–2. DOI: 10.1145/3569009.3576187"],
      "image": "../projects/intangible/images/intangible01.jpg",
      "selected": true
    },
    {
      "id": "hootbeat",
      "title": "HootBeat",
      "year": 2022,
      "authors": "JP Carrascal",
      "tags": ["Actuación en Vivo", "Tecnología Wearable"],
      "subtitle": "Una Plataforma para Wearables de Iluminación Controlados por MIDI",
      "description": "HootBeat es una plataforma integral para dispositivos wearable de iluminación controlados por MIDI que cierran la brecha entre la tecnología, las artes escénicas y la moda. El sistema permite a los músicos usar dispositivos de iluminación que responden dinámicamente a su actuación musical, creando espectáculos de luz sincronizados que mejoran las presentaciones en vivo.\n\nLa plataforma consta de gafas LED personalizadas equipadas con microcontroladores ESP32 para comunicación inalámbrica BLE-MIDI, un controlador de pedal personalizado, interfaces trigger-to-MIDI para batería acústica y capacidades de interacción con la audiencia basadas en la nube. El sistema ha sido utilizado en actuaciones en vivo por Spacebarman, incluyendo shows en las Festes de Maig de Barcelona.",
      "medium": "Medios mixtos: hardware y software personalizados, aplicación alojada en la nube",
      "exhibition": ["Conciertos de  Spacebarman"],
      "image": "../projects/hootbeat/images/hootbeat-spacebarman.png",
      "selected": true
    },
    {
      "id": "count-me-in",
      "title": "Count-Me-In",
      "year": 2022,
      "authors": "JP Carrascal",
      "tags": ["Participación de Audiencia", "Actuación en Vivo"],
      "subtitle": "Un secuenciador de música colaborativo para la participación de la audiencia",
      "description": "Los eventos musicales modernos crean una frontera entre los intérpretes y la audiencia, siendo solo los primeros los que juegan un papel activo. Count-Me-In es un secuenciador de música colaborativo que usa una arquitectura Web distribuida para promover la participación de la audiencia en actuaciones musicales, instalaciones y otros contextos relacionados.\n\nCount-Me-In utiliza un diseño de secuenciador de pasos para reducir los efectos negativos de la latencia de la red en la experiencia de los participantes. La interfaz basada en web permite que los miembros de la audiencia contribuyan a la creación musical en tiempo real, rompiendo las barreras tradicionales de desempeño.",
      "medium": "Digital: instalación de sonido interactivo colaborativo",
      "exhibition": ["SMC demo session, Saint Etienne, France, 2022.", "Conciertos de Spacebarman"],
      "publication": ["Carrascal, Juan Pablo. (2022, June 7). Count-Me-In: A Collaborative Step Sequencer for Audience Participation. Proceedings of the 2022 Sound and Music Computing Conference (SMC22). DOI: 10.5281/zenodo.6573453", "Carrascal, Juan Pablo. (2022, June 7). Social / Musical Gaming with Count-Me-in (demo). Proceedings of the 2022 Sound and Music Computing Conference (SMC22). DOI: 10.5281/zenodo.6576041"],
      "image": "../projects/count-me-in/images/countmein-venues.jpg",
      "selected": true
    },
    {
      "id": "ble-midi-glove",
      "title": "Controlador BLE-MIDI Glove",
      "year": 2021,
      "authors": "JP Carrascal",
      "tags": [],
      "subtitle": "Un controlador de guante basado en Bluetooth LE-MIDI para actuación musical",
      "description": "El Controlador BLE-MIDI Glove es una interfaz musical wearable que combina tecnología Bluetooth Low Energy (BLE) con protocolos de comunicación MIDI. Este proyecto representa un enfoque simple al control gestual de música, permitiendo a los intérpretes manipular el sonido a través de movimientos naturales de las manos y gestos de los dedos.\n\nConstruido usando tecnología moderna BluetoothLE-MIDI, el controlador de guante ofrece libertad de movimiento mientras mantiene una comunicación confiable de baja latencia con estaciones de trabajo de audio digital y sintetizadores. El dispositivo incorpora sensores de unidad de movimiento inercial (IMU) para capturar el movimiento de la mano y el posicionamiento del dedo medio, traduciéndolos en parámetros musicales expresivos.\n\nEste guante ha sido utilizado en actuaciones en vivo por Spacebarman, demostrando su aplicación práctica en contextos musicales profesionales.",
      "medium": "Hardware y software personalizados, integración textil",
      "exhibition": ["Conciertos de Spacebarman"],
      "image": "../projects/ble-midi-glove/images/main.jpg",
      "selected": true
    },
    {
      "id": "momc-controller",
      "title": "Controlador MIDI Modular MoMc",
      "year": 2021,
      "authors": "JP Carrascal",
      "tags": ["Actuación en Vivo", "Control de Estudio"],
      "subtitle": "Controlador de pedal MIDI modular basado en Arduino",
      "description": "El MoMc (Controlador MIDI Modular) es un controlador de pedal basado en Arduino diseñado para músicos que necesitan control flexible y programable sobre su configuración de audio digital. Este enfoque modular permite configuraciones personalizables según necesidades específicas de desempeño y contextos musicales.\n\nConstruido usando tecnología de microcontrolador Arduino, el controlador MoMc proporciona comunicación MIDI confiable con varios dispositivos musicales y software. El diseño modular permite a los músicos configurar el controlador según sus requisitos específicos, haciéndolo adecuado para diversas aplicaciones musicales desde actuación en vivo hasta trabajo de estudio.",
      "medium": "Hardware y software personalizados",
      "exhibition": ["Conciertos de Spacebarman"],
      "image": "../projects/momc-controller/images/main.jpg",
      "selected": true
    },
    {
      "id": "lockdown",
      "title": "Lockdown",
      "year": 2020,
      "authors": "JP Carrascal",
      "tags": [],
      "subtitle": "Un videoclip de realidad virtual interactivo para la canción \"Lockdown\" de Spacebarman. Construido con WebVR/WebXR, mejor experimentado con Oculus Quest.",
      "description": "Lockdown es un video musical interactivo innovador creado para la canción \"Lockdown\" de Spacebarman, desarrollado durante la pandemia global de 2020. Este proyecto representa un enfoque pionero para la visualización musical, combinando tecnología de realidad virtual con expresión artística para crear una experiencia audiovisual inmersiva.\n\nConstruido usando tecnologías WebVR/WebXR, el proyecto es accesible a través de navegadores web mientras ofrece una experiencia completamente inmersiva, particularmente cuando se ve con auriculares de realidad virtual como Oculus Quest. El enfoque basado en navegador garantiza la accesibilidad mientras empuja los límites de lo que es posible con realidad virtual basada en web.",
      "medium": "Digital: aplicación de realidad virtual WebVR/WebXR",
      "exhibition": ["Experiencia WebVR disponible en https://jpcarrascal.com/lockdown-vr/"],
      "image": "../projects/lockdown/images/main.jpg",
      "selected": true
    },
    {
      "id": "blesync",
      "title": "BLESync",
      "year": 2019,
      "authors": "JP Carrascal",
      "tags": ["Producción de Música", "Actuación en Vivo"],
      "subtitle": "Un dispositivo Bluetooth para sincronizar pedales de guitarra tap-tempo con DAWs de computadora",
      "description": "BLESync es un dispositivo Bluetooth especializado diseñado para cerrar la brecha entre los pedales de efectos de guitarra tradicionales y las estaciones de trabajo de audio digital modernas (DAWs). El dispositivo permite a los guitarristas sincronizar sus pedales tap-tempo con software de producción de música basado en computadora, creando una integración perfecta entre flujos de trabajo musicales analógicos y digitales.\n\nEsta herramienta aborda un desafío común en la producción de música moderna donde los músicos quieren mantener la sensación táctil de los pedales físicos mientras se benefician de la precisión y las capacidades de los sistemas de audio digital. BLESync garantiza una sincronización de tiempo precisa, crucial para escenarios de producción musical profesional y actuación en vivo.",
      "medium": "Hardware y software personalizados, carcasa de acrílico",
      "publication": ["Carrascal, Juan Pablo. (2019, June 26). BLESync: A Bluetooth Device for Synchronizing Tap-Tempo Guitar Pedals to Computer DAWs. Proceedings of the 2019 Sound and Music Computing Conference (SMC19). DOI: zenodo.3755756"],
      "image": "../projects/blesync/images/main.jpg",
      "selected": false
    },
    {
      "id": "magicscroll",
      "title": "MagicScroll",
      "year": 2018,
      "authors": "Antonio Gomes, Lahiru Lakmal Priyadarshana, Aaron Visser, Juan Pablo Carrascal, Roel Vertegaal",
      "tags": ["Interacción Humano-Computadora", "Interfaces de Forma Variable"],
      "subtitle": "Un dispositivo de pantalla enrollable con área de pantalla flexible e entrada gestual",
      "description": "Presentamos MagicScroll, una tableta enrollable con 2 pantallas multitáctiles flexibles concatenadas, ruedas de desplazamiento accionadas e entrada gestual. Cuando se enrolla, MagicScroll se puede usar como rodillo, teléfono inteligente, interfaz de mensajería expresiva o controlador gestual. Cuando se extiende, proporciona acceso completo a su pantalla multitáctil de alta resolución de 7.5\", proporcionando la funcionalidad de visualización de un dispositivo de tableta.\n\nCreemos que la forma cilíndrica en la configuración enrollada facilita la interacción gestual, mientras que sus capacidades de cambio de forma e entrada permiten la navegación de flujos de información continua y proporcionan funcionalidad de enfoque más contexto. Investigamos las affordances gestuales de MagicScroll en su configuración enrollada por medio de un estudio de elicitación.",
      "medium": "Hardware y software personalizados, pantallas flexibles recicladas.",
      "publication": ["Antonio Gomes, Lahiru Lakmal Priyadarshana, Aaron Visser, Juan Pablo Carrascal, Roel Vertegaal. (2018). Magicscroll: a rollable display device with flexible screen real estate and gestural input. DOI: 10.1145/3242587.3242652"],
      "image": "../projects/magicscroll/images/main.jpg",
      "selected": false
    },
    {
      "id": "ar-wall",
      "title": "AR Wall",
      "year": 2018,
      "authors": "JP Carrascal",
      "tags": ["Presentación de Investigación", "Intercambio de Conocimiento"],
      "subtitle": "Una instalación de realidad aumentada para compartir resultados de investigación de UX en Microsoft",
      "description": "AR Wall es una instalación de realidad aumentada innovadora diseñada para compartir resultados de proyectos de investigación de UX en Microsoft. Esta pared interactiva transforma métodos de presentación tradicionales al usar tecnología AR para crear una forma inmersiva y atractiva de comunicar hallazgos e ideas de investigación.\n\nEl proyecto aprovecha la realidad aumentada para superponer información digital en un espacio de pared física, permitiendo a los espectadores interactuar con datos de investigación, visualizaciones y hallazgos de manera espacial e intuitiva. Este enfoque hace que los resultados complejos de la investigación de UX sean más accesibles y atractivos para diversas audiencias dentro de la organización.",
      "medium": "Mixto: instalación física con realidad aumentada",
      "exhibition": ["Microsoft campus, Building 18, Redmond, WA, USA."],
      "image": "../projects/ar-wall/images/main.jpg",
      "selected": false
    },
    {
      "id": "haptics-cylindrical",
      "title": "Háptica en Pantallas Cilíndricas",
      "year": 2017,
      "authors": "Juan Pablo Carrascal, Roel Vertegaal",
      "tags": ["Percepción Humana", "Ilusiones Hápticas"],
      "subtitle": "Efectos de la Retroalimentación Táctil en la Percepción de Formas Virtuales en Objetos de Pantalla No Plana",
      "description": "En este artículo, reportamos un estudio que investiga una nueva ilusión háptica para alterar la percepción de formas 3D usando una pantalla no plana y fricción vibrotáctil. En nuestro estudio, presentamos una imagen de un prisma rectangular en una pantalla cilíndrica y una plana. Se pidió a los participantes que movieran su dedo índice horizontalmente a lo largo de la superficie de las pantallas hacia el borde del prisma rectangular.\n\nSe preguntó a los participantes si estaban experimentando una forma plana, cilíndrica o rectangular. En una condición, un estímulo vibrotáctil simulaba una fricción creciente hacia el borde visible del prisma rectangular, con una caída repentina cuando este borde fue cruzado por el dedo. Los resultados sugieren que presentar una imagen de un prisma rectangular, y aplicar fricción vibrotáctil, particularmente en una pantalla cilíndrica, aumentó significativamente las calificaciones de los participantes indicando que estaban experimentando una forma física rectangular.",
      "medium": "Hardware y software personalizados, pantallas flexibles recicladas y actuadores vibrotáctiles.",
      "publication": ["Juan Pablo Carrascal, Roel Vertegaal. (2017). Effects of tactile feedback on the perception of virtual shapes on non-planar DisplayObjects. DOI: 10.1145/3025453.3025788"],
      "image": "../projects/haptics-cylindrical/images/main.jpg",
      "selected": false
    },
    {
      "id": "reflex",
      "title": "ReFlex",
      "year": 2016,
      "authors": "Paul Strohmeier, Jesse Burstyn, Juan Pablo Carrascal, Vincent Levesque, Roel Vertegaal",
      "tags": ["Interfaces de Forma Variable", "Computación Móvil"],
      "subtitle": "Un teléfono inteligente flexible con retroalimentación háptica activa para entrada por flexión",
      "description": "ReFlex es un teléfono inteligente flexible con entrada por flexión y retroalimentación háptica activa. Las características de ReFlex permiten la introducción de sensaciones como fricción o resistencia. Reportamos resultados de un experimento usando ReFlex en una tarea de apuntamiento, así como reacciones iniciales de usuarios al prototipo.\n\nExploramos tanto retroalimentación háptica táctil absoluta como relativa, emparejada con dos tipos de asignaciones de entrada por flexión: control de posición y control de velocidad. Observamos que los cursores controlados por posición se emparejaban bien con retroalimentación relativa, mientras que los cursores controlados por velocidad se emparejaban bien con retroalimentación absoluta para indicar objetivos.\n\nTambién exploramos una condición sin los ojos. Los resultados sugieren que mientras los ojos sin retroalimentación háptica eran más propensos a errores que las condiciones de solo visual, el tamaño del error era relativamente pequeño, y los usuarios pudieron completar la tarea en todos los casos.",
      "medium": "Hardware y software personalizados, pantallas flexibles recicladas, actuadores vibrotáctiles",
      "publication": ["Paul Strohmeier, Jesse Burstyn, Juan Pablo Carrascal, Vincent Levesque, Roel Vertegaal. (2016). Reflex: A flexible smartphone with active haptic feedback for bend input. DOI: 10.1145/2839462.2839494"],
      "image": "../projects/reflex/images/main.jpg",
      "selected": false
    },
    {
      "id": "whammyphone",
      "title": "Whammyphone",
      "year": 2016,
      "authors": "Antonio Gomes, Lahiru Priyadarshana, Juan Pablo Carrascal, Roel Vertegaal",
      "tags": ["Interfaces de Música Tangible", "Manipulación de Audio"],
      "subtitle": "Explorando la manipulación de audio tangible usando entrada de flexión en un teléfono inteligente flexible",
      "description": "Presentamos WhammyPhone, una interfaz de audio novedosa que admite la manipulación física de audio digital a través de gestos de flexión. WhammyPhone combina una pantalla multitáctil flexible de alta resolución, sensores de flexión y un conjunto de técnicas de interacción intuitivas que permiten a los usuarios novatos manipular el sonido de forma tangible.\n\nCon WhammyPhone, los gestos de flexión pueden controlar parámetros tanto discretos (por ejemplo, activar una nota) como continuos (por ejemplo, flexión de pitch). Mostramos escenarios de aplicación que aprovechan las modalidades de entrada únicas de WhammyPhone y discutimos su potencial para la manipulación de audio digital.",
      "medium": "Hardware y software personalizados, pantallas flexibles recicladas",
      "publication": ["Antonio Gomes, Lahiru Priyadarshana, Juan Pablo Carrascal, Roel Vertegaal. (2016). Whammyphone: Exploring tangible audio manipulation using bend input on a flexible smartphone. DOI: 10.1145/2984751.2985742"],
      "image": "../projects/whammyphone/images/main.jpg",
      "selected": false
    },
    {
      "id": "shape-emotions",
      "title": "Cambios de Forma para Transmitir Emociones",
      "year": 2016,
      "authors": "Paul Strohmeier, Juan Pablo Carrascal, Bernard Cheng, Margaret Meban, Roel Vertegaal",
      "tags": ["Computación Afectiva", "Comunicación Basada en Forma"],
      "subtitle": "Una evaluación de cambios de forma para transmitir emociones",
      "description": "En este artículo, exploramos cómo las interfaces de forma variable podrían usarse para comunicar emociones. Presentamos dos estudios, uno que investiga qué formas podrían crear los usuarios con una superficie flexible 2D, y otro que estudia la eficacia de las formas resultantes para transmitir un conjunto de emociones básicas.\n\nLos resultados sugieren que los parámetros de forma se correlacionan con el carácter positivo o negativo de una emoción, mientras que los parámetros relacionados con el movimiento se correlacionan con el nivel de arousal. En varios casos, se utilizaron expresiones de forma simbólica basadas en metáforas visuales claras.\n\nLos resultados de nuestro segundo experimento sugieren que los participantes pudieron reconocer emociones dada una forma con buena precisión dentro del 28% de las dimensiones del Modelo Circumplex. Concluimos que la forma y los cambios de forma de una superficie flexible 2D efectivamente parecen ser capaces de transmitir emociones de una manera que merece una exploración futura.",
      "medium": "Tejido flexible aumentado con sensores de flexión, software personalizado",
      "publication": ["Paul Strohmeier, Juan Pablo Carrascal, Bernard Cheng, Margaret Meban, Roel Vertegaal. (2016). An evaluation of shape changes for conveying emotions. DOI: 10.1145/2858036.2858537"],
      "image": "../projects/shape-emotions/images/main.jpg",
      "selected": false
    },
    {
      "id": "bluemo",
      "title": "BlueMO",
      "year": 2016,
      "authors": "JP Carrascal",
      "tags": ["Producción de Música", "Controladores Inalámbricos"],
      "subtitle": "Traductor de Bluetooth LE a MIDI/OSC para Mac OS X",
      "description": "BlueMO es una aplicación traductora de Bluetooth Low Energy a MIDI/OSC diseñada específicamente para Mac OS X. Esta aplicación de utilidad permite la comunicación perfecta entre dispositivos BLE y software de música, permitiendo que controladores inalámbricos y sensores interactúen con estaciones de trabajo de audio digital y otras aplicaciones musicales.\n\nLa aplicación sirve como puente entre el ecosistema creciente de dispositivos Bluetooth LE y el software de producción de música tradicional, traduciendo datos de sensores inalámbricos en mensajes MIDI u órdenes OSC (Control de Sonido Abierto) que pueden ser entendidos por el software de música. Esto abre nuevas posibilidades para controladores musicales inalámbricos e sistemas de actuación interactiva.",
      "medium": "Software",
      "image": "../projects/bluemo/images/main.jpg",
      "selected": false
    },
    {
      "id": "bicing-spider",
      "title": "Bicing Spider",
      "year": 2011,
      "authors": "JP Carrascal",
      "tags": [],
      "subtitle": "Un experimento sobre web scraping y visualización interactiva usando Quartz Composer",
      "description": "Un experimento sobre web scraping y visualización interactiva usando Quartz Composer. Este proyecto explora técnicas de visualización de datos en tiempo real para datos del sistema público de bicicletas compartidas.",
      "medium": "Digital.",
      "image": "../projects/bicing-spider/images/main.jpg",
      "selected": false
    },
    {
      "id": "trackpad-controller",
      "title": "Controlador Trackpad",
      "year": 2010,
      "authors": "JP Carrascal",
      "tags": [],
      "subtitle": "Dispositivo Max for Live para usar el trackpad de un Macbook como controlador de Ableton Live",
      "description": "Dispositivo Max for Live para usar el trackpad de una Macbook como controlador de Ableton Live. Transforma el trackpad integrado del portátil en una interfaz de actuación musical.",
      "medium": "Medios interactivos",
      "image": "../projects/trackpad-controller/images/main.jpg",
      "selected": false
    },
    {
      "id": "random-controller",
      "title": "Controlador Aleatorio",
      "year": 2010,
      "authors": "JP Carrascal",
      "tags": [],
      "subtitle": "Un simple experimento sobre el uso de tirada de dados como fuente de control",
      "description": "Un simple experimento sobre el uso de tirada de dados como fuente de control para parámetros musicales, explorando operaciones de azar en actuación de música electrónica.",
      "medium": "Medios mixtos: experiencia interactiva construida con lámpara reciclada, dados y software",
      "image": "../projects/random-controller/images/main.jpg",
      "selected": false
    },
    {
      "id": "multitouchmixer",
      "title": "Mezclador Multitáctil",
      "year": 2010,
      "authors": "JP Carrascal, Sergi Jordà",
      "tags": [],
      "subtitle": "Interfaz para Mezcla de Audio con Tecnología Multitáctil (Tesis de Maestría)",
      "description": "Interfaz para Mezcla de Audio con Tecnología Multitáctil (Tesis de Maestría). Explora cómo las interfaces multitáctiles pueden mejorar los flujos de trabajo tradicionales de mezcla de audio.",
      "medium": "Medios interactivos: software personalizado corriendo en plataforma ReacTable.",
      "publication": ["Carrascal, Juan Pablo, and Sergi Jordà. 2011. \"Multitouch Interface for Audio Mixing.\" In Proceedings of New Interfaces for Musical Expression (NIME '11)."],
      "image": "../projects/multitouchmixer/images/multitouch-frame.jpg",
      "selected": true
    },
    {
      "id": "augmented-guitar",
      "title": "Guitarra Aumentada",
      "year": 2024,
      "authors": "JP Carrascal",
      "tags": [],
      "subtitle": "Guitarra eléctrica aumentada con sensores",
      "description": "Mejora electrónica para guitarras eléctricas usando sensorescon el fin de expandir sus capacidades expresivas. He desarrollado varias versiones de esta guitarra aumentada a lo largo de los años, incorporando diferentes tipos de sensores para capturar gestos y movimientos del intérprete y traducirlos en controles MIDI para manipular efectos de sonido en tiempo real durante actuaciones en vivo o sesiones de estudio.\n\nLa guitarra aumentada ha sido utilizada en actuaciones en vivo por Spacebarman, demostrando su aplicación práctica en contextos musicales profesionales.",
      "medium": "Medios mixtos: hardware y software personalizados",
      "exhibition": ["Conciertos de Spacebarman"],
      "image": "../projects/augmented-guitar/images/mariposa.jpg",
      "selected": true
    },
    {
      "id": "yo-soy-otro",
      "title": "Yo Soy Otro (banda sonora)",
      "year": 2008,
      "authors": "JP Carrascal, Alejandro Ramírez",
      "tags": ["soundtrack", "banda sonora"],
      "subtitle": "Banda sonora original para el largometraje 'Yo Soy Otro' de Oscar Campo",
      "description": "Esta banda sonora bebe de la música trip hop, electrónica e industrial, complementando la atmósfera oscura y opresiva característica del filme. \n\nSINOPSIS: <i>Cali, Colombia, año de 2002. José González, un ingeniero de sistemas de edad mediana, descubre en su piel las señales de la litomiasis, un extraño y mortal mal que, según informes de los medios, ha llegado a la ciudad desde la selva amazónica. Las personas que son atacadas por el virus mueren a los pocos días de haber contraído la enfermedad, al quedar sus cuerpos a merced de una segunda epidermis de bacterias voraces.  Horrorizado por lo que la enfermedad ha comenzado a hacer en su cuerpo, José intenta quitarse la vida. En el momento de apuntar con un revólver en su boca, es sacudido por una violenta explosión: una bomba ha sido colocada en la vecindad.  Esa noche y durante los días siguientes José descubre muchos dobles suyos, como si en la ciudad se hubiera multiplicado hasta el infinito su ego estallado y enfermo. Todos los dobles están infectados con el mismo virus y se están matando entre si en interminables luchas fratricidas. Y todos se igualan en crueldad, más allá de las razones que hagan justicia a sus luchas</i>.",
      "medium": "Música: banda sonora original",
      "image": "../projects/yo-soy-otro/images/yo-soy-otro.jpg",
      "selected": true
    }
  ]
}
